                     1
                     |
           ----------------------
          |                      |
          2                      3
          |                      |
     -----------            -----------
    |           |                      |
    4           5                      6
                                  -----------
                                 |
                                 7

result：

前序遍历：[1，2，4，5，3，6，7]
中序遍历：[4，2，5，1，3，7，6]
后序遍历：[4，5，2，7，6，3，1]

树的遍历：
都是从root出发，按照如下优先级进行 跳转`输出：

前序遍历：根节点 >> 左子树 >> 右子树
中序遍历：左子树 >> 根节点 >> 右子树
后续遍历：左子树 >> 右子树 >> 根节点


下面以中序遍历为例，详细讲解遍历过程：
中序遍历：左子树  -->根节点 -->右子树

step1:

先找到根节点1；

发现1有左子树，是2，因此跳转到左子树2的遍历过程；

发现2有左子树，是4，因此跳转到左子树4的遍历过程；

发现4没有左子树，不需要继续跳转，也不输出；

4是子树根节点，输出：4

发现4没有右子树，不需要继续跳转，也不输出；

该层子树遍历完成，跳回到上一层子树中。

step2:

2的左子树遍历完成；

2是子树根节点，输出：2

发现2有右子树，是5，因此跳转到右子树5的遍历过程；

step3:

发现5没有左子树，不需要继续跳转，也不输出；

5是子树根节点，输出：5

发现5没有右子树，不需要继续跳转，也不输出；

该子树遍历完成，跳回到上一层子树中。

step4:

该层子树遍历完成，跳回到上一层子树中。

step5:

1的左子树遍历完成；

1是子树根节点，输出：1

发现1有右子树，是3，因此跳转到右子树3的遍历过程；

step6:

发现3没有左子树，不需要继续跳转，也不输出；

3是子树根节点，输出：3

发现3有右子树，是6，因此跳转到右子树6的遍历过程

step7:

发现6有左子树，是7，因此跳转到左子树4的遍历过程；

发现7没有左子树，不需要继续跳转，也不输出；

7是子树根节点，输出：7

发现7没有右子树，不需要继续跳转，也不输出；

该层子树遍历完成，跳回到上一层子树中。

step8:

6的左子树遍历完成；

6是子树根节点，输出：6

发现6没有右子树，不需要继续跳转，也不输出；

step9:

该层子树遍历完成，跳回到上一层子树中。

step10:

该层子树遍历完成，所有书遍历完成。
